(function() {
    myChart = echarts.init(document.querySelector(".map .chart"));

    var geoCoordMap = {
        北京市: [116.4551, 40.2539],
        天津市: [117.4219, 39.4189],
        河北省: [114.4995, 38.1006],
        山西省: [112.3352, 37.9413],
        内蒙古自治区: [110.3467, 41.4899],
        辽宁省: [123.1238, 42.1216],
        吉林省: [125.8154, 44.2584],
        黑龙江省: [127.9688, 45.368],
        上海市: [121.4648, 31.2891],
        江苏省: [118.8062, 31.9208],
        安徽省: [117.29, 32.0581],
        浙江省: [119.5313, 29.8773],
        福建省: [119.4543, 25.9222],
        江西省: [116.0046, 28.6633],
        山东省: [117.1582, 36.8701],
        河南省: [113.4668, 34.6234],
        湖北省: [114.3896, 30.6628],
        湖南省: [113.0823, 28.2568],
        广东省: [113.12244, 23.009505],
        广西壮族自治区: [108.479, 23.1152],
        海南省: [110.3893, 19.8516],
        重庆市: [108.384366, 30.439702],
        四川省: [103.9526, 30.7617],
        贵州省: [106.6992, 26.7682],
        云南省: [102.9199, 25.4663],
        陕西省: [109.1162, 34.2004],
        甘肃省: [103.5901, 36.3043],
        青海省: [101.4038, 36.8207],
        宁夏回族自治区: [106.3586, 38.1775],
        新疆维吾尔自治区: [87.9236, 43.5883],
        西藏自治区: [91.11, 29.97],
};
var d1 = {
      '北京市':41.12,
      '天津市':212.27,
      '河北省':3829.25,
      '山西省':1355.1,
      '内蒙古自治区':3254.54,
      '辽宁省':2330.74,
      '吉林省':4154,
      '黑龙江省':7410.34,
      '上海市':99.78,
      '江苏省':3610.8,
      '浙江省':580.14,
      '安徽省':4019.71,
      '福建省':487.15,
      '江西省':2221.73,
      '山东省':5374.31,
      '河南省':6524.25,
      '湖北省':2846.13,
      '湖南省':3073.6,
      '广东省':1208.56,
      '广西壮族自治区':1370.49,
      '海南省':138.11,
      '重庆市':1079.88,
      '四川省':3488.9,
      '贵州省':1242.45,
      '云南省':1843.42,
      '西藏自治区':106.53,
      '陕西省':1194.2,
      '甘肃省':1105.9,
      '青海省':102.55,
      '宁夏回族自治区':370.05,
      '新疆维吾尔自治区':1484.73,
};
var d2 = {
      '北京市':34.14,
      '天津市':209.69,
      '河北省':3700.86,
      '山西省':1380.4,
      '内蒙古自治区':3553.28,
      '辽宁省':2192.45,
      '吉林省':3632.74,
      '黑龙江省':7506.8,
      '上海市':103.74,
      '江苏省':3660.28,
      '浙江省':599.14,
      '安徽省':4007.25,
      '福建省':498.58,
      '江西省':2190.7,
      '山东省':5319.51,
      '河南省':6648.91,
      '湖北省':2839.47,
      '湖南省':3022.9,
      '广东省':1193.49,
      '广西壮族自治区':1372.8,
      '海南省':147.12,
      '重庆市':1079.34,
      '四川省':3493.7,
      '贵州省':1059.7,
      '云南省':1860.54,
      '西藏自治区':104.4,
      '陕西省':1226,
      '甘肃省':1151.43,
      '青海省':103.06,
      '宁夏回族自治区':392.58,
      '新疆维吾尔自治区':1504.23,
};
var d3 = {
      '北京市':28.76,
      '天津市':223.25,
      '河北省':3739.24,
      '山西省':1361.8,
      '内蒙古自治区':3652.54,
      '辽宁省':2429.95,
      '吉林省':3877.93,
      '黑龙江省':7503.01,
      '上海市':95.89,
      '江苏省':3706.2,
      '浙江省':592.15,
      '安徽省':4054,
      '福建省':493.9,
      '江西省':2157.45,
      '山东省':5357,
      '河南省':6695.36,
      '湖北省':2724.98,
      '湖南省':2974.84,
      '广东省':1240.8,
      '广西壮族自治区':1332,
      '海南省':144.96,
      '重庆市':1075.15,
      '四川省':3498.5,
      '贵州省':1051.24,
      '云南省':1870.03,
      '西藏自治区':103.92,
      '陕西省':1231.13,
      '甘肃省':1162.58,
      '青海省':105.54,
      '宁夏回族自治区':373.15,
      '新疆维吾尔自治区':1527.07,
};
var d4 = {
      '北京市':30.53,
      '天津市':228.18,
      '河北省':3795.89,
      '山西省':1424.27,
      '内蒙古自治区':3664.1,
      '辽宁省':2338.83,
      '吉林省':3803.17,
      '黑龙江省':7540.78,
      '上海市':91.44,
      '江苏省':3729.06,
      '浙江省':605.7,
      '安徽省':4019.22,
      '福建省':502.32,
      '江西省':2163.88,
      '山东省':5446.81,
      '河南省':6825.8,
      '湖北省':2727.43,
      '湖南省':3015.12,
      '广东省':1267.56,
      '广西壮族自治区':1370.02,
      '海南省':145.47,
      '重庆市':1081.42,
      '四川省':3527.43,
      '贵州省':1057.63,
      '云南省':1895.86,
      '西藏自治区':102.87,
      '陕西省':1274.83,
      '甘肃省':1202.21,
      '青海省':107.42,
      '宁夏回族自治区':380.49,
      '新疆维吾尔自治区':1583.4,
};
var d5 = {
      '北京市':37.75,
      '天津市':249.87,
      '河北省':3825.09,
      '山西省':1421.25,
      '内蒙古自治区':3840.3,
      '辽宁省':2538.74,
      '吉林省':4039.24,
      '黑龙江省':7867.72,
      '上海市':93.96,
      '江苏省':3746.1,
      '浙江省':620.9,
      '安徽省':4087.56,
      '福建省':506.42,
      '江西省':2192.33,
      '山东省':5500.75,
      '河南省':6544.17,
      '湖北省':2764.33,
      '湖南省':3074.36,
      '广东省':1279.87,
      '广西壮族自治区':1386.54,
      '海南省':146.03,
      '重庆市':1092.84,
      '四川省':3582.14,
      '贵州省':1094.86,
      '云南省':1930.3,
      '西藏自治区':106.15,
      '陕西省':1270.43,
      '甘肃省':1231.46,
      '青海省':109.09,
      '宁夏回族自治区':368.44,
      '新疆维吾尔自治区':1735.78,
};

var years =['2017年','2018年','2019年','2020年','2021年'];

    var mapData = [
        [],
        [],
        [],
        [],
        [],
        [],
    ];

    for (var key in geoCoordMap) {
        mapData[0].push({
            "years": '2017',
            "name": key,
            "value": d1[key] ,
        });
        mapData[1].push({
            "years": '2018',
            "name": key,
            "value": d2[key] ,
        });
        mapData[2].push({
            "years": '2019',
            "name": key,
            "value": d3[key] ,
        });
        mapData[3].push({
            "years": '2020',
            "name": key,
            "value": d4[key] ,
        });
        mapData[4].push({
            "years": '2021',
            "name": key,
            "value": d5[key] ,
        });

    }
var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var geoCoord = geoCoordMap[data[i].name];
        if (geoCoord) {
            res.push({
               name: data[i].name,
                value: geoCoord.concat(data[i].value)
            });
        }
    }
    return res;
};


var option1 = {
    baseOption: {
        timeline: {
            axisType: 'category',
            orient: 'horizontal',
            autoPlay: true,
            inverse: false,
            playInterval: 3000,
            left: '10%',
            right: '10%',
            bottom: '0%',
            width: '80%',
            label: {
                normal: {
                    textStyle: {
                        color: 'rgb(179, 239, 255)',
                    },
                },
            emphasis: {
                textStyle: {
                    color: '#ffffff',
                },
            },
            },
        lineStyle: {
                color: '#8df4f4'
        },
        checkpointStyle: {
            borderColor: '#8df4f4',
            color: '#53D9FF',
            borderWidth: 2,
        },
        controlStyle: {
            showNextBtn: true,
            showPrevBtn: true,
            normal: {
                color: '#53D9FF',
                borderColor: '#53D9FF'
            },
            emphasis: {
                color: 'rgb(58,115,192)',
                borderColor: 'rgb(58,115,192)'
            }
        },
        data: years,
        },

        tooltip : {
            show:false,
            trigger:'item',
            formatter: '{b}:{c}',
        },
    },
    options:[]
};
for (var n = 0; n < years.length; n++) {

            option1.options.push({
                title: {
                    text: years[n]+ '全国各地区主要粮食产量统计情况（单位：万吨）',
                    subtext: '数据来源：国家统计局',
                    left: 'center',
		            top:'40',
                    textStyle: {color: '#fff'
                                }},
                geo: {
                    map: 'china',

                    label: {

                         emphasis: {
                                show: true,
                                color: "#fff"
                         }
                    },
                    roam: false,
		            zoom:1.2,
                    itemStyle: {
                    normal: {
                    areaColor: 'rgba(2,37,101,.5)',
                      borderColor: 'rgba(112,187,252,.5)'
                     },
                emphasis: {
                areaColor: 'rgba(2,37,101,.8)'
                }
                    }
                  },
                series: [

        {
            name: '主要粮食产量',
            type: 'effectScatter',
            coordinateSystem: 'geo',
            data: convertData(mapData[n]),
            tooltip : {
            trigger: 'item',
    },
            symbolSize: function (val) {
                return val[2] /150;
            },
            showEffectOn: 'render',
            rippleEffect: {
                brushType: 'stroke',
            },

            label: {
                normal: {
                    formatter: '{b}:{@[2]}',
                    position: 'right',
                    show: false,
                    fontsize:50,
                },
                emphasis: {
                    show: true
                },

            },
            itemStyle: {
                normal: {
                    color: 'yellow'
                }
            }
        },


                ]
            })

        }
  myChart.setOption(option1);
  window.addEventListener("resize", function() {
    myChart.resize();
  });
})();
